:::::::::::::::::::::::::::::::::::::::::::::
@echo off
if "%cd%\" EQU "%~dp0" ((start notepad++ %0)&&(exit /b))
::переход в папку где лежит батник
echo %cd%
cd %~dp0
echo %cd%
:::::::::::::::::::::::::::::::::::::::::::::
::пакетный файл принимает параметры ^%^0 ^%^1 ... %^9. ^
::ѕараметров пакетного запуска может быть сколько угодно, 
::Ќо прилично считаетс€ до 9 параметров
::ќбратите внимание,  есть метод сдвигающий параметры пакетного запуска в лево
::Ќо пока мне это не требовалось
::ѕомотрим параметры пакетного запуска именно этого батника
echo %%0%%=%0
echo %%1%%=%1
echo %%2%%=%2
echo %%3%%=%3
echo %%4%%=%4
echo %%5%%=%5
echo %%6%%=%6
echo %%7%%=%7
echo %%8%%=%8
echo %%9%%=%9

echo ::::::::::::::::::::::::::::::::::
::ѕомотрим параметры пакетного запуска локальной функции
call :foo q w e r t y u i o a s d f g h j k

:::::::::::::::::::::::::::::::::::::::::::::
(TIMEOUT /T 10)&&(pause)&&(exit /b)
:::::::::::::::::::::::::::::::::::::::::::::


:foo
	echo %%0%%=%0
	echo %%1%%=%1
	echo %%2%%=%2
	echo %%3%%=%3
	echo %%4%%=%4
	echo %%5%%=%5
	echo %%6%%=%6
	echo %%7%%=%7
	echo %%8%%=%8
	echo %%9%%=%9	
	echo %%10%%=%10
	echo %%15%%=%15
exit /b