::Рассматриваем возможность того что 
::Менюшка может быть сложнее чем просто папка с микробатниками
:::::::::::::::::::::::::::::::::::::::::::::
@echo off
if "%cd%\" EQU "%~dp0" ((start notepad++ %0)&&(exit))
cd %~dp0
setlocal EnableDelayedExpansion
title %~0
cls
:::::::::::::::::::::::::::::::::::::::::::::
::Этот эксперимерн показывает что арифметика в батниках это интеджер с + и - значениеми,
::У него есть минимум и максимум
set /a qwe=0
for /L %%j in (1,1,10000000000000000000000000000) do (

for /L %%i in (1,1,10000) do (
	set /a qwe=!qwe!+10000
	)
title !qwe!
echo qwe = !qwe!
)
:::::::::::::::::::::::::::::::::::::::::::::
(TIMEOUT /T 1)&&(pause)&&(exit /b)
:::::::::::::::::::::::::::::::::::::::::::::
