::Нужно сначала дать тему виртуальных переменных
setlocal EnableDelayedExpansion
:::::::::::::::::::::::::::::::::::::::::::::
@echo off
if "%cd%\" EQU "%~dp0" ((start notepad++ %0)&&(exit /b))
cd %~dp0
:::::::::::::::::::::::::::::::::::::::::::::


::в БАТНИКАХ МАССИВОВ НЕТ
:: Есть два способа их реализовать
:: Способ первый - через текстовую переменную.
:: Посмотрите на глобальные переменные через ";"
:: Способ второй
::Создание массива
(set A.Count=4)&&(set A.0=90)&&(set A.1=91)&&(set A.2=92)&&(set A.3=93)
::Вывод на экран массива
(echo A.Count=%A.Count%)&&(echo A.0=%A.0%)&&(echo A.1=%A.1%)&&(echo A.2=%A.2%)&&(echo A.3=%A.3%)
for /L %%i in (0,1,3) do (echo A.%%i =!A.%%i! )
::Уничтожение массива
(set A.Count= )&&(set A.0= )&&(set A.1= )&&(set A.2= )&&(set A.3= )
(echo A.Count=%A.Count%)&&(echo A.0=%A.0%)&&(echo A.1=%A.1%)&&(echo A.2=%A.2%)&&(echo A.3=%A.3%)


call :array new A "'one','two','three','foo','bar'"
:: Получение третьего элемента в result:
call :array get A 3 result
echo %result%
:: Изменение нулевого элемента
call :array set A 0 "первый элемент"ы
::::::::::::::::::::::::::::::::::::::::::::
(TIMEOUT /T 1)&&(pause)&&(exit /b)
:::::::::::::::::::::::::::::::::::::::::::::
