@echo off
cd %~dp0
echo ::::::::::::::::::::::::::::::::::::::::::::::::
::Получение всех переменных среды
set
rem Что нужно знать:
rem rem и :: - два способа комментирования программного кода
rem по умолчанию согласимся использовать rem
rem для документирования функций и описания текстовой теории
rem :: -  для комментирования программных кодов и коментариев низкой важности, то есть
rem Чтобы добавить переменную, в командной строке введите

::----------------------------------------------
::Задержка по времени
TIMEOUT /T 10
::Пауза
pause